001.codedFunctionObject/orgCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1.5;

deltaT          0.001;

writeControl    adjustable;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           5;

functions
{
    inletFlow
    {
        type                surfaceFieldValue;
        libs                ("libfieldFunctionObjects.so");
        log                 true;
        executeControl      writeTime;
        executeInterval     1;
        writeFields         true;
        regionType          patch;
        operation           sum;
        surfaceFormat       none;
        fields              (phi);
        name                inlet;
    }
    outlet1Flow
    {
        $inletFlow;
        name                outlet1;
    }
    outlet2Flow
    {
        $inletFlow;
        name                outlet2;
    }
}

// ************************************************************************* //
